xzcvczx/mla-legacy/Graphics MultiApp Demo/Alternative Configurations/HardwareProfile_GFX_PICTAIL_V3_8PMP_PIC32_USB_STK_SSD1926_USBMSD_HID_TFT_G240320LTSW_118W_E.h
// Error Checking
	#ifndef GRAPHICS_HARDWARE_PLATFORM
		#error "Error: GRAPHICS_HARDWARE_PLATFORM is not defined!"
	#endif

    #ifndef DISPLAY_CONTROLLER
        #error "Error: DISPLAY_CONTROLLER not defined"
    #endif

    #if ((GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V3) || (GRAPHICS_HARDWARE_PLATFORM == DA210_DEV_BOARD)) && !defined(DISPLAY_PANEL)
        #error "Error: DISPLAY_PANEL not defined"
    #endif

	#if (DISPLAY_CONTROLLER == LGDP4531) || (DISPLAY_CONTROLLER == S6D0129)	||		\
		(DISPLAY_PANEL == TFT2N0369_E)	 || (DISPLAY_PANEL == DT032TFT_TS)	||		\
		(DISPLAY_PANEL == DT032TFT)		 ||											\
		(DISPLAY_PANEL == TFT_G240320LTSW_118W_E)	 
			#define DISP_ORIENTATION    90
	#else
            #define DISP_ORIENTATION    0
	#endif
     
    #if (DISPLAY_CONTROLLER == LGDP4531) || (DISPLAY_CONTROLLER == S6D0129)

        #define DISP_HOR_RESOLUTION 240
        #define DISP_VER_RESOLUTION 320

    #elif (DISPLAY_PANEL == TFT_G240320LTSW_118W_E) || (DISPLAY_PANEL == TFT2N0369_E) || \
          (DISPLAY_PANEL == DT032TFT_TS) || (DISPLAY_PANEL == DT032TFT)

        #define DISP_HOR_RESOLUTION 240
        #define DISP_VER_RESOLUTION 320

        #define DISP_DATA_WIDTH 18

        #define DISP_INV_LSHIFT

        #define DISP_HOR_PULSE_WIDTH    25
        #define DISP_HOR_BACK_PORCH     5
        #define DISP_HOR_FRONT_PORCH    10

        #define DISP_VER_PULSE_WIDTH    4
        #define DISP_VER_BACK_PORCH     0
        #define DISP_VER_FRONT_PORCH    2

        #if (DISPLAY_CONTROLLER == MCHP_DA210)
        
            #define GFX_LCD_TYPE                        GFX_LCD_TFT

            #define GFX_DISPLAYENABLE_ENABLE
            #define GFX_HSYNC_ENABLE
            #define GFX_VSYNC_ENABLE
            #define GFX_DISPLAYPOWER_ENABLE

            #define GFX_CLOCK_POLARITY                  GFX_ACTIVE_HIGH
            #define GFX_DISPLAYENABLE_POLARITY          GFX_ACTIVE_HIGH
            #define GFX_HSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_VSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYPOWER_POLARITY           GFX_ACTIVE_HIGH
            
        #endif

    #elif (DISPLAY_PANEL == TFT_G320240DTSW_69W_TP_E) || (DISPLAY_PANEL == _35QVW0T)

        #define DISP_HOR_RESOLUTION 320
        #define DISP_VER_RESOLUTION 240

        #define DISP_DATA_WIDTH 18

      //#define DISP_INV_LSHIFT

        #define DISP_HOR_PULSE_WIDTH    25
        #define DISP_HOR_BACK_PORCH     8
        #define DISP_HOR_FRONT_PORCH    8

        #define DISP_VER_PULSE_WIDTH    8
        #define DISP_VER_BACK_PORCH     7
        #define DISP_VER_FRONT_PORCH    5

    #elif (DISPLAY_PANEL == PH480272T_005_I06Q) || (DISPLAY_PANEL == PH480272T_005_I11Q)

        #define DISP_HOR_RESOLUTION 480
        #define DISP_VER_RESOLUTION 272

        #define DISP_DATA_WIDTH 24

      //#define DISP_INV_LSHIFT

        #define DISP_HOR_PULSE_WIDTH    41
        #define DISP_HOR_BACK_PORCH     2
        #define DISP_HOR_FRONT_PORCH    2

        #define DISP_VER_PULSE_WIDTH    10
        #define DISP_VER_BACK_PORCH     2
        #define DISP_VER_FRONT_PORCH    2

        #if (DISPLAY_CONTROLLER == MCHP_DA210)
        
            #define GFX_LCD_TYPE                        GFX_LCD_TFT

            #define GFX_DISPLAYENABLE_ENABLE
            #define GFX_HSYNC_ENABLE
            #define GFX_VSYNC_ENABLE
            #define GFX_DISPLAYPOWER_ENABLE

            #define GFX_CLOCK_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYENABLE_POLARITY          GFX_ACTIVE_HIGH
            #define GFX_HSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_VSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYPOWER_POLARITY           GFX_ACTIVE_HIGH

        #endif

    #else

        #error "Graphics controller is not defined"

    #endif // DISPLAY_CONTROLLER == ABC


/*********************************************************************
* IOS FOR THE DISPLAY CONTROLLER
*********************************************************************/
	#if (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V1)

		// Definitions for reset pin
		#define RST_TRIS_BIT    TRISCbits.TRISC1
        #define RST_LAT_BIT     LATCbits.LATC1

		// Definitions for RS pin
        #define RS_TRIS_BIT TRISBbits.TRISB15
        #define RS_LAT_BIT  LATBbits.LATB15

		// Definitions for CS pin
        #define CS_TRIS_BIT TRISDbits.TRISD8
        #define CS_LAT_BIT  LATDbits.LATD8

		// Definitions for FLASH CS pin
        #define CS_FLASH_LAT_BIT    LATDbits.LATD9
        #define CS_FLASH_TRIS_BIT   TRISDbits.TRISD9

	#elif (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V2)
        #if (DISPLAY_CONTROLLER == LGDP4531)
            #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)

				// Definitions for reset pin
                #define RST_TRIS_BIT    TRISAbits.TRISA4
                #define RST_LAT_BIT     LATAbits.LATA4

				// Definitions for RS pin
                #define RS_TRIS_BIT TRISAbits.TRISA1
                #define RS_LAT_BIT  LATAbits.LATA1

				// Definitions for CS pin
                #define CS_TRIS_BIT TRISBbits.TRISB15
                #define CS_LAT_BIT  LATBbits.LATB15

				// Definitions for FLASH CS pin
                #define CS_FLASH_LAT_BIT    LATAbits.LATA8
                #define CS_FLASH_TRIS_BIT   TRISAbits.TRISA8

				// Definitions for POWER ON pin
                #define POWERON_LAT_BIT     LATAbits.LATA10
                #define POWERON_TRIS_BIT    TRISAbits.TRISA10

            #else

				// Definitions for reset pin
                #define RST_TRIS_BIT    TRISCbits.TRISC1
                #define RST_LAT_BIT     LATCbits.LATC1

				// Definitions for RS pin
                #define RS_TRIS_BIT TRISCbits.TRISC2
                #define RS_LAT_BIT  LATCbits.LATC2

				// Definitions for CS pin
                #define CS_TRIS_BIT TRISDbits.TRISD10
                #define CS_LAT_BIT  LATDbits.LATD10

				// Definitions for FLASH CS pin
                #define CS_FLASH_LAT_BIT    LATDbits.LATD1
                #define CS_FLASH_TRIS_BIT   TRISDbits.TRISD1

