xzcvczx/mla-legacy/Graphics MultiApp Demo/Alternative Configurations/HardwareProfile_GFX_PICTAIL_V3_8PMP_PIC32_USB_STK_SSD1926_USBMSD_HID_TFT_G240320LTSW_118W_E.h
				// Definitions for POWER ON pin
                #define POWERON_LAT_BIT     LATCbits.LATC3
                #define POWERON_TRIS_BIT    TRISCbits.TRISC3
            #endif
        #elif (DISPLAY_CONTROLLER == SSD1906)

			// Definitions for reset line
            #define RST_TRIS_BIT    TRISCbits.TRISC1
            #define RST_LAT_BIT     LATCbits.LATC1

			// Definitions for RS line
            #define RS_TRIS_BIT TRISCbits.TRISC2
            #define RS_LAT_BIT  LATCbits.LATC2

			// Definitions for CS line
            #define CS_TRIS_BIT TRISDbits.TRISD10
            #define CS_LAT_BIT  LATDbits.LATD10

			// Definitions for A0 line
            #define A0_LAT_BIT  LATDbits.LATD3
            #define A0_TRIS_BIT TRISDbits.TRISD3

			// Definitions for A17 line
            #define A17_LAT_BIT     LATGbits.LATG14
            #define A17_TRIS_BIT    TRISGbits.TRISG14

        #else
            #error GRAPHICS CONTROLLER IS NOT SUPPORTED
        #endif // (DISPLAY_CONTROLLER == ...
    #elif (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V3)
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)

			// Definitions for reset pin
            #define RST_TRIS_BIT    TRISAbits.TRISA4
            #define RST_LAT_BIT     LATAbits.LATA4

			// Definitions for RS pin
            #define RS_TRIS_BIT TRISAbits.TRISA1
            #define RS_LAT_BIT  LATAbits.LATA1

			// Definitions for CS pin
            #define CS_TRIS_BIT TRISBbits.TRISB15
            #define CS_LAT_BIT  LATBbits.LATB15

        #else

			// Definitions for reset line
            #define RST_TRIS_BIT    TRISCbits.TRISC1
            #define RST_LAT_BIT     LATCbits.LATC1

			// Definitions for RS line
            #define RS_TRIS_BIT TRISCbits.TRISC2
            #define RS_LAT_BIT  LATCbits.LATC2

			// Definitions for CS line
            #define CS_TRIS_BIT TRISDbits.TRISD10
            #define CS_LAT_BIT  LATDbits.LATD10
        #endif
    #endif // (GRAPHICS_HARDWARE_PLATFORM == ...

/*********************************************************************
* IO FOR THE BEEPER
*********************************************************************/
    #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
        #define BEEP_TRIS_BIT   TRISBbits.TRISB4
        #define BEEP_LAT_BIT    LATBbits.LATB4
    #else
        #define BEEP_TRIS_BIT   TRISDbits.TRISD0
        #define BEEP_LAT_BIT    LATDbits.LATD0
    #endif

/*********************************************************************
* IOS FOR THE FLASH/EEPROM SPI
*********************************************************************/

    #if ((GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V2) || (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V1))
        #if  defined(__PIC24F__) || defined(__PIC24H__) || defined(__dsPIC33F__)
            #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
                #define EEPROM_CS_TRIS  TRISAbits.TRISA0
                #define EEPROM_CS_LAT   LATAbits.LATA0
            #elif defined(__PIC24FJ256GB110__)
				// This PIM has RD12 rerouted to RG0
                #define EEPROM_CS_TRIS  TRISGbits.TRISG0
                #define EEPROM_CS_LAT   LATGbits.LATG0
            #else
                #define EEPROM_CS_TRIS  TRISDbits.TRISD12
                #define EEPROM_CS_LAT   LATDbits.LATD12
            #endif
        #elif defined(__PIC32MX__)
            #define EEPROM_CS_TRIS  TRISDbits.TRISD12
            #define EEPROM_CS_LAT   LATDbits.LATD12
        #endif
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
            #define EEPROM_SCK_TRIS TRISCbits.TRISC2
            #define EEPROM_SDO_TRIS TRISCbits.TRISC0
            #define EEPROM_SDI_TRIS TRISCbits.TRISC1
        #else
            #define EEPROM_SCK_TRIS TRISGbits.TRISG6
            #define EEPROM_SDO_TRIS TRISGbits.TRISG8
            #define EEPROM_SDI_TRIS TRISGbits.TRISG7
        #endif
    #elif (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V3)
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
            #define SST25_CS_TRIS   TRISAbits.TRISA8
            #define SST25_CS_LAT    LATAbits.LATA8
            #define SST25_SCK_TRIS  TRISCbits.TRISC2
            #define SST25_SDO_TRIS  TRISCbits.TRISC0
            #define SST25_SDI_TRIS  TRISCbits.TRISC1
        #else
            #define SST25_CS_TRIS   TRISDbits.TRISD1
            #define SST25_CS_LAT    LATDbits.LATD1
            #define SST25_SCK_TRIS  TRISGbits.TRISG6
            #define SST25_SDO_TRIS  TRISGbits.TRISG8
            #define SST25_SDI_TRIS  TRISGbits.TRISG7
			#define SST25_SDI_ANS   ANSGbits.ANSG7
        #endif
    #elif (GRAPHICS_HARDWARE_PLATFORM == DA210_DEV_BOARD)
        #define SST25_CS_TRIS   TRISAbits.TRISA14
        #define SST25_CS_LAT    LATAbits.LATA14
        #define SST25_SCK_TRIS  TRISDbits.TRISD8
        #define SST25_SDO_TRIS  TRISBbits.TRISB1
        #define SST25_SDI_TRIS  TRISBbits.TRISB0
        #define SST25_SDI_ANS   ANSBbits.ANSB0
        #define SST25_SDO_ANS   ANSBbits.ANSB1
    #endif

/*********************************************************************
* IOS FOR THE GRAPHICS PICTAIL PARALLEL FLASH MEMORY
*********************************************************************/
#if (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V1)
	#define SST39_CS_TRIS    TRISDbits.TRISD9
	#define SST39_CS_LAT     LATDbits.LATD9
	#define SST39_A18_TRIS   TRISBbits.TRISB11
	#define SST39_A18_LAT    LATBbits.LATB11
	#define SST39_A17_TRIS   TRISBbits.TRISB10
	#define SST39_A17_LAT    LATBbits.LATB10
	#define SST39_A16_TRIS   TRISDbits.TRISD3
	#define SST39_A16_LAT    LATDbits.LATD3
#elif (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V2)
	#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__) 
		#define SST39_CS_TRIS    TRISAbits.TRISA8
		#define SST39_CS_LAT     LATAbits.LATA8
		#define SST39_A18_TRIS   TRISAbits.TRISA1
		#define SST39_A18_LAT    LATAbits.LATA1
		#define SST39_A17_TRIS   TRISCbits.TRISC5
		#define SST39_A17_LAT    LATCbits.LATC5
		#define SST39_A16_TRIS   TRISCbits.TRISC4
		#define SST39_A16_LAT    LATCbits.LATC4
	#else
		#define SST39_CS_TRIS    TRISDbits.TRISD1
		#define SST39_CS_LAT     LATDbits.LATD1
		#define SST39_A18_TRIS   TRISCbits.TRISC2
		#define SST39_A18_LAT    LATCbits.LATC2
		#define SST39_A17_TRIS   TRISGbits.TRISG15
		#define SST39_A17_LAT    LATGbits.LATG15
		#define SST39_A16_TRIS   TRISGbits.TRISG14
		#define SST39_A16_LAT    LATGbits.LATG14
	#endif
#endif


/*********************************************************************
* IOS FOR THE TOUCH SCREEN
*********************************************************************/

	// ADC channel constants
    #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
        #define ADC_TEMP        4
        #define ADC_POT         0
        #define ADC_POT_TRIS    TRISAbits.TRISA0
        #define ADC_POT_PCFG    AD1PCFGLbits.PCFG0
    #elif defined(__PIC32MX__)
        #define ADC_TEMP    ADC_CH0_POS_SAMPLEA_AN4
        #define ADC_POT     ADC_CH0_POS_SAMPLEA_AN5
    #else
        #define ADC_TEMP    4
        #define ADC_POT     5
    #endif

    #if (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V1)
        #ifdef __PIC32MX__
            #define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN13
            #define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN12
        #else
            #define ADC_XPOS    13
            #define ADC_YPOS    12
        #endif

		// Y port definitions
        #define ADPCFG_XPOS AD1PCFGbits.PCFG13
        #define LAT_XPOS    LATBbits.LATB13
        #define LAT_XNEG    LATBbits.LATB11
        #define TRIS_XPOS   TRISBbits.TRISB13
        #define TRIS_XNEG   TRISBbits.TRISB11

		// X port definitions
        #define ADPCFG_YPOS AD1PCFGbits.PCFG12
        #define LAT_YPOS    LATBbits.LATB12
        #define LAT_YNEG    LATBbits.LATB10
        #define TRIS_YPOS   TRISBbits.TRISB12
        #define TRIS_YNEG   TRISBbits.TRISB10

    #elif (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V2)
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
            #define ADC_XPOS    5
            #define ADC_YPOS    4
        #elif defined(__PIC32MX__)
            #define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN11
            #define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN10
        #else
            #define ADC_XPOS    11
            #define ADC_YPOS    10
        #endif
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)

			// Y port definitions
            #define ADPCFG_XPOS AD1PCFGLbits.PCFG5
            #define LAT_XPOS    LATBbits.LATB3
            #define LAT_XNEG    LATCbits.LATC9
            #define TRIS_XPOS   TRISBbits.TRISB3
            #define TRIS_XNEG   TRISCbits.TRISC9

			// X port definitions
            #define ADPCFG_YPOS AD1PCFGLbits.PCFG4
            #define LAT_YPOS    LATBbits.LATB2
            #define LAT_YNEG    LATCbits.LATC8
            #define TRIS_YPOS   TRISBbits.TRISB2
            #define TRIS_YNEG   TRISCbits.TRISC8

        #else

			// Y port definitions
            #define ADPCFG_XPOS AD1PCFGbits.PCFG11
            #define LAT_XPOS    LATBbits.LATB11
            #define LAT_XNEG    LATGbits.LATG13
            #define TRIS_XPOS   TRISBbits.TRISB11
            #define TRIS_XNEG   TRISGbits.TRISG13

			// X port definitions
            #define ADPCFG_YPOS AD1PCFGbits.PCFG10
            #define LAT_YPOS    LATBbits.LATB10
            #define LAT_YNEG    LATGbits.LATG12
            #define TRIS_YPOS   TRISBbits.TRISB10
            #define TRIS_YNEG   TRISGbits.TRISG12
        #endif
    #elif (GRAPHICS_HARDWARE_PLATFORM == GFX_PICTAIL_V3)
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
            #define ADC_XPOS    5
            #define ADC_YPOS    4
        #elif defined(__PIC32MX__)
            #define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN11
            #define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN10
        #else
            #define ADC_XPOS    11
            #define ADC_YPOS    10
        #endif
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)

			// Y port definitions
            #define ADPCFG_XPOS AD1PCFGLbits.PCFG5
            #define LAT_XPOS    LATBbits.LATB3
            #define LAT_XNEG    LATCbits.LATC9
            #define TRIS_XPOS   TRISBbits.TRISB3
            #define TRIS_XNEG   TRISCbits.TRISC9

			// X port definitions
            #define ADPCFG_YPOS AD1PCFGLbits.PCFG4
            #define LAT_YPOS    LATBbits.LATB2
            #define LAT_YNEG    LATCbits.LATC8
            #define TRIS_YPOS   TRISBbits.TRISB2
            #define TRIS_YNEG   TRISCbits.TRISC8

        #else

			// Y port definitions
            #define ADPCFG_XPOS AD1PCFGbits.PCFG11
            #define LAT_XPOS    LATBbits.LATB11
            #define TRIS_XPOS   TRISBbits.TRISB11

            #if defined(__32MX460F512L__) && !defined (PIC32_USB_STK)
                #define LAT_XNEG    LATGbits.LATG15
                #define TRIS_XNEG   TRISGbits.TRISG15
            #else
                #define LAT_XNEG    LATDbits.LATD9
                #define TRIS_XNEG   TRISDbits.TRISD9
            #endif

			// X port definitions
            #define ADPCFG_YPOS AD1PCFGbits.PCFG10
            #define LAT_YPOS    LATBbits.LATB10
            #define LAT_YNEG    LATDbits.LATD8
            #define TRIS_YPOS   TRISBbits.TRISB10
            #define TRIS_YNEG   TRISDbits.TRISD8
        #endif
    #elif (GRAPHICS_HARDWARE_PLATFORM == DA210_DEV_BOARD)
        #if defined(__PIC24FJ256DA210__)
            #define ADC_XPOS    16
            #define ADC_YPOS    18

			// Y port definitions
            #define ADPCFG_XPOS ANSCbits.ANSC4
            #define LAT_XPOS    LATCbits.LATC4
            #define TRIS_XPOS   TRISCbits.TRISC4
            #define LAT_XNEG    LATAbits.LATA2
            #define TRIS_XNEG   TRISAbits.TRISA2
         
			// X port definitions
            #define ADPCFG_YPOS ANSGbits.ANSG7
            #define LAT_YPOS    LATGbits.LATG7
            #define TRIS_YPOS   TRISGbits.TRISG7
        	#define LAT_YNEG    LATAbits.LATA1
            #define TRIS_YNEG   TRISAbits.TRISA1
        #endif
    #endif

/*********************************************************************
* IOS FOR THE SIDE BUTTONS
*********************************************************************/
    #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
        #define BTN_S3  _RA9
        #define BTN_S4  0
        #define BTN_S5  0
        #define BTN_S6  0
    #elif defined(__PIC24FJ256DA210__)
        #define BTN_S1  _RG8
        #define BTN_S2  _RE9
        #define BTN_S3  _RB5
	#elif defined (__32MX460F512L__) && defined (PIC32_USB_STK) 
		#if defined (USE_16BIT_PMP)
			// cannot use PIC32 Starter kit buttons when 16 bit PMP is enabled.
			// PMP is using the IO pins 
	        #define BTN_S3  0 
			#define BTN_S4  0
			#define BTN_S5  0
	        #define BTN_S6  0
		#else
	        #define BTN_S3  _RD13
			#define BTN_S4  _RD7
			#define BTN_S5  _RD6
			#define BTN_S6  0
		#endif 
	#else
        #define BTN_S3  _RD6
        #define BTN_S4  _RD13
        #define BTN_S5  _RA7
        #define BTN_S6  _RD7
    #endif

/*********************************************************************
* IOS FOR THE TCON 
*********************************************************************/
#if (GRAPHICS_HARDWARE_PLATFORM == DA210_DEV_BOARD)
	#if (DISPLAY_PANEL == TFT_G240320LTSW_118W_E)
		#define CS_PORT     _RA0
		#define CS_TRIS     _TRISA0
		#define CS_DIG()
	    
		#define SCL_PORT    _RD8
		#define SCL_TRIS    _TRISD8
		#define SCL_DIG()
	    
		#define SDO_PORT    _RB1
		#define SDO_TRIS    _TRISB1
		#define SDO_DIG()   _ANSB1 = 0;
	    
		#define DC_PORT     _RB0
		#define DC_TRIS     _TRISB0
		#define DC_DIG()    _ANSB0 = 0;

	#endif // #if (DISPLAY_PANEL == TFT_G240320LTSW_118W_E)
#endif // #if (GRAPHICS_HARDWARE_PLATFORM == DA210_DEV_BOARD)

#endif //ifdef _GRAPHICS_H

/*********************************************************************
* IOS FOR THE UART
*********************************************************************/
    #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
        #define TX_TRIS TRISCbits.TRISC1
        #define RX_TRIS TRISCbits.TRISC0
	#elif defined(__PIC24FJ256DA210__)    
        #define TX_TRIS TRISFbits.TRISF3
        #define RX_TRIS TRISDbits.TRISD0
    #else
        #define TX_TRIS TRISFbits.TRISF5
        #define RX_TRIS TRISFbits.TRISF4
    #endif

/*********************************************************************
* RTCC DEFAULT INITIALIZATION (these are values to initialize the RTCC
*********************************************************************/
    #define RTCC_DEFAULT_DAY        18      // 18
    #define RTCC_DEFAULT_MONTH      11      // November
    #define RTCC_DEFAULT_YEAR       9       // 2009
    #define RTCC_DEFAULT_WEEKDAY    05      // Friday
    #define RTCC_DEFAULT_HOUR       10      // 10:10:01
    #define RTCC_DEFAULT_MINUTE     10
    #define RTCC_DEFAULT_SECOND     01

/*********************************************************************
 *********************************************************************
 * IOS FOR THE SD Card INTERFACE
 * Used only when Demos using SD Card is enabled
 * For PIC24FJ256GB110 Use SPI1 only. SPI2 pins in PICtail Plus is
 * used by USB.
 * For PIC24FJ256GA110 Use SPI2 only. SPI2 pins in PICtail Plus is
 * used by USB.
 * For PIC32MX360F512L Use SPI1 only. 
 ********************************************************************* 
*********************************************************************/
/* SD Card definitions: Change these to fit your application when using
   an SD-card-based physical layer                                   */
	#if defined (__32MX460F512L__)

		//SPI Configuration
		#define SPI_START_CFG_1 (PRI_PRESCAL_64_1 | SEC_PRESCAL_8_1 | MASTER_ENABLE_ON | SPI_CKE_ON | SPI_SMP_ON)
		#define SPI_START_CFG_2 (SPI_ENABLE)
		// Define the SPI frequency
		#define SPI_FREQUENCY   (20000000)

		// Description: SD-SPI Chip Select Output bit
		#define SD_CS   PORTBbits.RB1
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS  TRISBbits.TRISB1
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD   PORTFbits.RF0
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS  TRISFbits.TRISF0
		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE   PORTFbits.RF1
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS  TRISFbits.TRISF1

		// Description: The main SPI control register
		#define SPICON1 SPI1CON
		// Description: The SPI status register
		#define SPISTAT SPI1STAT
		// Description: The SPI Buffer
		#define SPIBUF  SPI1BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF SPI1STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits SPI1CONbits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits SPI1STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE   SPICON1bits.ON
		// Description: The definition for the SPI baud rate generator register (PIC32)
		#define SPIBRG  SPI1BRG

		// Tris pins for SCK/SDI/SDO lines
		// Description: The TRIS bit for the SCK pin
		#define SPICLOCK    TRISFbits.TRISF6
		// Description: The TRIS bit for the SDI pin
		#define SPIIN   TRISFbits.TRISF7
		// Description: The TRIS bit for the SDO pin
		#define SPIOUT  TRISFbits.TRISF8
		
		//SPI library functions
		#define putcSPI                     putcSPI1
		#define getcSPI                     getcSPI1
		#define OpenSPI(config1, config2)   OpenSPI1(config1, config2)

	#elif defined (__32MX360F512L__)
		//SPI Configuration
		#define SPI_START_CFG_1     (PRI_PRESCAL_64_1 | SEC_PRESCAL_8_1 | MASTER_ENABLE_ON | SPI_CKE_ON | SPI_SMP_ON)
		#define SPI_START_CFG_2     (SPI_ENABLE)

		// Define the SPI frequency
		#define SPI_FREQUENCY		(20000000)

		// Description: SD-SPI Chip Select Output bit
		#define SD_CS               PORTBbits.RB1
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS          TRISBbits.TRISB1
	            
